app/views/children/show.html.erb

                <% if group_add %>
                  <%= @child.group.name %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]