app/controllers/teachers/directions_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_teacher
      @teacher = Teacher.find(params[:teacher_id])

SELECT "directions".* FROM "directions" WHERE "directions"."teacher_id" = ? LIMIT ?  [["teacher_id", 3], ["LIMIT", 1]]
---
    def set_direction
      @direction = Direction.find(params[:id])