app/controllers/teachers/groups_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? ORDER BY "teachers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_teacher
      @teacher = Teacher.find(params[:teacher_id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_group
      @group = Group.find(params[:group_id])