app/controllers/teachers/groups_controller.rb

INSERT INTO "groups" ("name", "subject", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "nakitto-catherine-study-group"], ["subject", "Mathematics"], ["teacher_id", 1], ["created_at", "2021-06-10 15:48:10.909689"], ["updated_at", "2021-06-10 15:48:10.909689"]]
---
  def create
    @group = @teacher.groups.new group_params
    @group.teacher_id = current_teacher.id

    if @group.save