app/views/groups/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."teacher_id" = ?  [["teacher_id", 1]]
---
      <% elsif teacher_signed_in? %>
        <% current_teacher.groups.each do |group| %>