app/views/home/dashboard.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."child_id" = ? LIMIT ?  [["child_id", 1], ["LIMIT", 1]]
---
      <% if child_signed_in? %>
        <% if current_child.address.present? %>

SELECT "profiles".* FROM "profiles" WHERE "profiles"."child_id" = ? LIMIT ?  [["child_id", 1], ["LIMIT", 1]]
---
          <div class="mb-5">
            <% if current_child.profile.present? %>

SELECT "directions".* FROM "directions" WHERE "directions"."teacher_id" = ? LIMIT ?  [["teacher_id", 1], ["LIMIT", 1]]
---
      <% elsif teacher_signed_in? %>
        <% if current_teacher.direction.present? %>

SELECT "details".* FROM "details" WHERE "details"."teacher_id" = ? LIMIT ?  [["teacher_id", 1], ["LIMIT", 1]]
---
          <div class="mb-5">
            <% if current_teacher.detail.present? %>

SELECT "groups".* FROM "groups" WHERE "groups"."teacher_id" = ?  [["teacher_id", 1]]
---
              </div>
              <% if current_teacher.groups.present? %>