app/helpers/application_helper.rb

SELECT "members".* FROM "members" WHERE "members"."group_id" = ? AND "members"."child_id" = ? LIMIT ?  [["group_id", 1], ["child_id", 1], ["LIMIT", 1]]
---
  def member_or_not_member_btn(group)
    member = Member.find_by(group: group, child: current_child)