app/views/teachers/_profileForm.html.erb

SELECT "groups".* FROM "groups"
---
        <%= form.label :group_id, "Choose a Group:", class: "mt-3" %>
        <%= form.collection_select(:group_id, Group.all, :id, :name) %>