app/views/teachers/show.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% if group_add %>
                  <%= @teacher.group.name %>