app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all

INSERT INTO "addresses" ("landmark", "latitude", "longitude", "child_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)
    @address.child_id = current_child.id

    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "landmark" = ?, "longitude" = ?, "latitude" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["landmark", "Paradise Guest House and Gardens Namugongo, Kampala, Uganda"], ["longitude", 32.658527], ["latitude", 0.384687], ["updated_at", "2020-12-19 08:21:01.679452"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_address
      @address = Address.find(params[:id])