app/controllers/addresses_controller.rb

  def create
    @address = Address.create address_params
    @address.child_id = current_child.id

    if @address.save
---
INSERT INTO "addresses" ("landmark", "latitude", "longitude", "child_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @address.update(address_params)
---
UPDATE "addresses" SET "landmark" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["landmark", "NISA SUPERMARKET, Namugongo Road, Kampala, Uganda"], ["latitude", 0.3858054], ["longitude", 32.65282059999999], ["updated_at", "2021-06-29 08:29:49.504427"], ["id", 1]]

    def set_address
      @address = Address.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]