app/controllers/admin_sessions_controller.rb

  def create
    admin = Admin.find_by_email(params[:email])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "cathie@homeschool.ug"], ["LIMIT", 1]]