app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "teachers"
SELECT COUNT(*) FROM "teachers" WHERE "teachers"."group_id" IS NULL
SELECT COUNT(*) FROM "groups"
SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @teacher_count = Teacher.all.size
    @child_count = Child.all.size
    @group_count = Group.all.size
    @user_count = @teacher_count + @child_count
    @ugrouped_child_count = Child.where(group_id: nil).size
    @ugrouped_teacher_count = Teacher.where(group_id: nil).size

    @teachers = Teacher.first(5)