app/controllers/application_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_teacher
    @current_teacher ||= Teacher.find(session[:teacher_id]) if session[:teacher_id]

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_admin
    @current_admin ||= Admin.find(session[:admin_id]) if session[:admin_id]

SELECT  1 AS one FROM "groups" LIMIT ?  [["LIMIT", 1]]
---
  def group_add
    if @group
      @group_add ||= Group.exists?

SELECT 1 AS one FROM "addresses" LIMIT ?  [["LIMIT", 1]]
---
  def address_add
    if @address
      @address_add ||= Address.exists?

SELECT  1 AS one FROM "directions" LIMIT ?  [["LIMIT", 1]]
---
  def direction_add
    if @direction
      @direction_add ||= Direction.exists?