app/controllers/details_controller.rb

  def create
    @detail = Detail.create detail_params
    @detail.teacher_id = current_teacher.id

    if @detail.save
---
INSERT INTO "details" ("phone", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phone", "0789678900"], ["teacher_id", 1], ["created_at", "2021-06-14 05:35:51.884440"], ["updated_at", "2021-06-14 05:35:51.884440"]]