app/controllers/directions_controller.rb

INSERT INTO "directions" ("landmark", "latitude", "longitude", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @direction = Direction.create direction_params
    @direction.teacher_id = current_teacher.id

    if @direction.save

SELECT "directions".* FROM "directions" WHERE "directions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_direction
      @direction = Direction.find(params[:id])