app/controllers/directions_controller.rb

SELECT "directions".* FROM "directions"
---
  def index
    @directions = Direction.all

INSERT INTO "directions" ("landmark", "latitude", "longitude", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @direction = Direction.new(direction_params)
    @direction.teacher_id = current_teacher.id

    respond_to do |format|
      if @direction.save

SELECT  "directions".* FROM "directions" WHERE "directions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_direction
      @direction = Direction.friendly.find(params[:id])