app/controllers/groups_controller.rb

  def show
    @group_count = Child.where(group_id: @group.id).size
    @children = Child.where(group_id: @group.id)
    @teachers = Teacher.where(group_id: @group.id)
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."group_id" = ?  [["group_id", 1]]

    def set_group
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]