app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    @groups = Group.all

INSERT INTO "groups" ("name", "subject", "grade", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Winners-Namugongo"], ["subject", "Reading"], ["grade", "Pre-school"], ["teacher_id", 1], ["created_at", "2021-06-14 05:40:51.220429"], ["updated_at", "2021-06-14 05:40:51.220429"]]
INSERT INTO "groups" ("name", "subject", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "nakitto-catherine-study-group-2"], ["subject", "English"], ["teacher_id", 1], ["created_at", "2021-06-10 22:40:41.448331"], ["updated_at", "2021-06-10 22:40:41.448331"]]
---
  def create
    @group = Group.create group_params
    @group.teacher_id = current_teacher.id

    if @group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_group
      @group = Group.find(params[:id])