app/controllers/members_controller.rb

  def create
    @member = current_child.members.new(group_id: params[:group_id])

    if @member.save
---
INSERT INTO "members" ("child_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["child_id", 1], ["group_id", 1], ["created_at", "2021-06-14 09:42:11.784605"], ["updated_at", "2021-06-14 09:42:11.784605"]]

  def destroy
    member = Member.find_by(id: params[:id], child: current_child, group_id: params[:group_id])

    if member
      member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? AND "members"."child_id" = ? AND "members"."group_id" = ? LIMIT ?  [["id", 1], ["child_id", 1], ["group_id", 1], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]