app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    @profile = Profile.new(profile_params)
    @profile.teacher_id = current_teacher.id

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("per_charge", "fee", "experience", "commitment", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "updated_at" = ? WHERE "profiles"."id" = ?  [["updated_at", "2021-04-12 21:58:16.941351"], ["id", 1]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]