app/controllers/profiles_controller.rb

UPDATE "profiles" SET "updated_at" = ? WHERE "profiles"."id" = ?  [["updated_at", "2021-04-12 21:58:16.941351"], ["id", 1]]
INSERT INTO "profiles" ("grade", "phone", "child_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["grade", "Pre-school"], ["phone", "0770456577"], ["child_id", 2], ["created_at", "2021-06-13 10:12:33.793416"], ["updated_at", "2021-06-13 10:12:33.793416"]]
---
  def create
    @profile = Profile.create profile_params
    @profile.child_id = current_child.id

    if @profile.save