app/controllers/teacher_sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = ? LIMIT ?  [["email", "werehenry2@gmail.com"], ["LIMIT", 1]]
---
  def create
    teacher = Teacher.find_by_email(params[:email])