app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def index
    @teachers = Teacher.all

SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 10]]
---
  def teachershome
    @teachers = Teacher.first(10)

INSERT INTO "teachers" ("name", "phone", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    # @teacher = Teacher.new(teacher_params)

    teacher = Teacher.create!(
      name: params['teacher']['name'],
      phone: params['teacher']['phone'],
      grade: params['teacher']['grade'],
      subject: params['teacher']['subject'],
      password: params['teacher']['password'],
      password_confirmation: params['teacher']['password_confirmation']
    )

UPDATE "teachers" SET "grade" = ?, "subject" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["grade", "Primary One"], ["subject", "Science"], ["updated_at", "2020-12-20 14:49:36.087954"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @teacher.update(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 2]]
---
  def destroy
    @teacher.destroy

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_teacher
      @teacher = Teacher.find(params[:id])