app/controllers/teacher_sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."phone" = ? LIMIT ?  [["phone", "0700112233"], ["LIMIT", 1]]
---
  def create
    teacher = Teacher.find_by_phone(params[:phone])