app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all

INSERT INTO "videos" ("title", "youtube", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Fractions - Introduction"], ["youtube", "2nB4LDFAMKE"], ["created_at", "2021-06-29 15:47:18.690047"], ["updated_at", "2021-06-29 15:47:18.690047"]]
UPDATE "videos" SET "updated_at" = ? WHERE "videos"."id" = ?  [["updated_at", "2021-07-01 14:45:28.385514"], ["id", 1]]
---
  def create
    @video = Video.create video_params

    if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_video
      @video = Video.find(params[:id])